app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      new_song = Song.find_or_create_by(title: song[0])
      new_artist = Artist.find_or_create_by(name: song[1])
---
INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-08-13 18:58:45.221086"], ["updated_at", "2019-08-13 18:58:45.221086"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."title" = ? LIMIT 1  [["title", "Caught Up in You"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-08-13 18:58:45.226868"], ["updated_at", "2019-08-13 18:58:45.226868"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]